# language: zh-CN
  功能: 二叉树

  @ok
  场景大纲: 插入数据，并形成有效二叉树
    假如有一个Tree类的实例，初始化数据为
    而且通过调用这个实例的insert方法，插入测试数据<datas>
    当对这个实例调用inorder方法，参数
    那么inorder方法返回<inorder>
    当对这个实例调用preorder方法，参数
    那么preorder方法返回<preorder>
    当对这个实例调用postorder方法，参数
    那么postorder方法返回<postorder>

    例子:
    | datas                  | inorder                | preorder               | postorder |
    | [1]                    | [1]                    | [1]                    | [1]       |
    | [3, 2, 1]              | [1, 2, 3]              | [3,2,1]                | [1,2,3]   |
    | [7,5,3,34,12,67,100,2] | [2,3,5,7,12,34,67,100] | [7,5,3,2,34,12,67,100] | [2,3,5,12,100,67,34,7] |
    | []                     | []                     | []                     | [] |
    | [3,6,1,4,2,10]         | [1,2,3,4,6,10]         | [3,1,2,6,4,10]         | [2,1,4,10,6,3] |




  
  