# language: zh-CN

功能: ok

  场景大纲: ok1
    当对OK1.execute输入<ary>
    那么输出<result>

    例子:
    | ary                 | result |
    | [1,3,5,7,8,25,4,20] | 5      |
    | [2,3,5,7,100,17]    | 4      |
    | [4,6,9,12]          | -1     |
    | [100]               | 0      |
    | []                  | -1     |
    | [1,2]               | -1     |


  场景大纲: ok2
    当对OK2.execute输入<ary>
    那么输出<result>

    例子:
    | ary                 | result |
    | [3,3,1,2,3]         | 0      |
    | [1,3,1,3,3]         | 1      |
    | []                  | -1     |
    | [1,3,1,3,2]         | -1     |
    | [1]                 | 0      |
    | [1,2]               | -1     |